secret/gdb.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-05-15 sam. 19:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>gdb</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Sholde" />
</head>
<body>
<div id="content">
<h1 class="title">gdb</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf567f6f">1. Introduction</a></li>
<li><a href="#orgb8959dd">2. Installation</a>
<ul>
<li><a href="#org8730336">2.1. Exemple on Arch Linux</a></li>
</ul>
</li>
<li><a href="#orgc70e0f2">3. Usage</a></li>
<li><a href="#org779db42">4. Interface</a></li>
<li><a href="#org2f360bc">5. List of command</a>
<ul>
<li><a href="#org9e134a6">5.1. Execute and quit</a></li>
<li><a href="#orgb6f6bab">5.2. Breakpoint</a></li>
<li><a href="#orgf727a60">5.3. Print</a></li>
<li><a href="#org4732e53">5.4. Callstak</a></li>
<li><a href="#orgedd3c03">5.5. Disassemble</a></li>
<li><a href="#org1b96640">5.6. Move</a></li>
</ul>
</li>
<li><a href="#org96f396a">6. Tips</a></li>
<li><a href="#org807da3f">7. Exemple</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf567f6f" class="outline-2">
<h2 id="orgf567f6f"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>gdb</b> is the GNU debugger. It is often used to debug <b>ELF</b> programs written in
<b>C</b>.
</p>
</div>
</div>

<div id="outline-container-orgb8959dd" class="outline-2">
<h2 id="orgb8959dd"><span class="section-number-2">2</span> Installation</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>gdb</b> is a popular tool and it is probably in your pakage manager list.
</p>
</div>

<div id="outline-container-org8730336" class="outline-3">
<h3 id="org8730336"><span class="section-number-3">2.1</span> Exemple on Arch Linux</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-shell">$ sudo pacman -S --needed gdb
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc70e0f2" class="outline-2">
<h2 id="orgc70e0f2"><span class="section-number-2">3</span> Usage</h2>
<div class="outline-text-2" id="text-3">
<p>
Compile your program normally. Then run this command to use <b>gdb</b>:
</p>

<div class="org-src-container">
<pre class="src src-shell">$ gdb ./program
</pre>
</div>
</div>
</div>

<div id="outline-container-org779db42" class="outline-2">
<h2 id="org779db42"><span class="section-number-2">4</span> Interface</h2>
<div class="outline-text-2" id="text-4">
<p>
<b>gdb</b> is a mini-shell, that is it will use your terminal but you will be able
 to type only its comand.
</p>
</div>
</div>

<div id="outline-container-org2f360bc" class="outline-2">
<h2 id="org2f360bc"><span class="section-number-2">5</span> List of command</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9e134a6" class="outline-3">
<h3 id="org9e134a6"><span class="section-number-3">5.1</span> Execute and quit</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><b>r or run:</b> run your program in gdb</li>
<li><b>q or quit:</b> quit gdb</li>
</ul>
</div>
</div>

<div id="outline-container-orgb6f6bab" class="outline-3">
<h3 id="orgb6f6bab"><span class="section-number-3">5.2</span> Breakpoint</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li><b>b or breakpoint:</b> set a breakpoint</li>
<li><b>c or continue:</b> continue to the next breakpoint</li>
</ul>
</div>
</div>

<div id="outline-container-orgf727a60" class="outline-3">
<h3 id="orgf727a60"><span class="section-number-3">5.3</span> Print</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><b>p or print:</b> print the value of the variable</li>
<li><b>w or watch:</b> print the value of the variable each time where it is set</li>
</ul>
</div>
</div>

<div id="outline-container-org4732e53" class="outline-3">
<h3 id="org4732e53"><span class="section-number-3">5.4</span> Callstak</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li><b>up:</b> go back to call</li>
<li><b>bt:</b> print the callstack</li>
</ul>
</div>
</div>

<div id="outline-container-orgedd3c03" class="outline-3">
<h3 id="orgedd3c03"><span class="section-number-3">5.5</span> Disassemble</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li><b>disas or disassemble:</b> disassemble the given ot the latest function where
breakpoint is set</li>
</ul>
</div>
</div>

<div id="outline-container-org1b96640" class="outline-3">
<h3 id="org1b96640"><span class="section-number-3">5.6</span> Move</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li><b>stepi or nexti:</b> they will go at the next <b>assembler</b> instruction but <b>nexti</b>
will just go on your program instuction normally.</li>
<li><b>s or step / n or next:</b> same as above but here they will go to the next
<b>code</b> instruciton</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org96f396a" class="outline-2">
<h2 id="org96f396a"><span class="section-number-2">6</span> Tips</h2>
<div class="outline-text-2" id="text-6">
<p>
Use <code>-g3</code> flag at compile line to enable all gdb fonctionality.
</p>
</div>
</div>

<div id="outline-container-org807da3f" class="outline-2">
<h2 id="org807da3f"><span class="section-number-2">7</span> Exemple</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #aeee00;">#include</span> <span style="color: #f4cf86;">&lt;stdio.h&gt;</span>

<span style="color: #ff9eb8;">int</span> <span style="color: #ffa724;">main</span>(<span style="color: #ff9eb8;">int</span> <span style="color: #ffa724;">argc</span>, <span style="color: #ff9eb8;">char</span> **<span style="color: #ffa724;">argv</span>)
{
  <span style="color: #ff9eb8;">char</span> *<span style="color: #ffa724;">s</span> = <span style="color: #f4cf86;">"Hello World"</span>;
  printf(<span style="color: #f4cf86;">"%s\n"</span>, s);
  <span style="color: #ff2c4b; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">$ gcc -g3 hello.c -o hello
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">$ gdb ./hello
</pre>
</div>

<p>
Normally you should be have something like:
</p>

<div class="org-src-container">
<pre class="src src-shell">GNU gdb (GDB) 10.1
<span style="color: #ffa724;">Copyright</span> (C) 2020 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/">&lt;http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type </a><span style="color: #f4cf86;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/">"show copying"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/"> and </a><span style="color: #f4cf86;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/">"show warranty"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/"> for details.
This GDB was configured as </a><span style="color: #f4cf86;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/">"x86_64-pc-linux-gnu"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/">.
Type </a><span style="color: #f4cf86;"><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/">"show configuration"</a></span><a href="http://gnu.org/licenses/gpl.html&gt;
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.
Type &quot;show copying&quot; and &quot;show warranty&quot; for details.
This GDB was configured as &quot;x86_64-pc-linux-gnu&quot;.
Type &quot;show configuration&quot; for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/"> for configuration details.
For bug reporting instructions, please see:
&lt;https://www.gnu.org/software/gdb/bugs/&gt;.
Find the GDB manual and other documentation resources online at:
    &lt;http://www.gnu.org/software/gdb/documentation/&gt;</a>.

For help, type <span style="color: #f4cf86;">"help"</span>.
Type <span style="color: #f4cf86;">"apropos word"</span> to search for commands related to <span style="color: #f4cf86;">"word"</span>...
Reading symbols from ./hello...
(gdb) 
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">(gdb) b main
Breakpoint 1 at 0x1148: file hello.c, line 5.
(gdb) r
Starting program: /home/sholde/dev/perso/Sholde.github.io/secret/hello 

Breakpoint 1, main (<span style="color: #ffa724;">argc</span>=1, <span style="color: #ffa724;">argv</span>=0x7fffffffe4a8) at hello.c:5
5         char *s = <span style="color: #f4cf86;">"Hello World"</span>;
(gdb) disas
Dump of assembler code for <span style="color: #ff2c4b; font-weight: bold;">function</span> <span style="color: #ffa724;">main</span>:
   0x0000555555555139 &lt;+0&gt;:     push   %rbp
   0x000055555555513a &lt;+1&gt;:     mov    %rsp,%rbp
   0x000055555555513d &lt;+4&gt;:     sub    $<span style="color: #ffa724;">0</span>x20,%rsp
   0x0000555555555141 &lt;+8&gt;:     mov    %edi,-0x14(%rbp)
   0x0000555555555144 &lt;+11&gt;:    mov    %rsi,-0x20(%rbp)
=&gt; 0x0000555555555148 &lt;+15&gt;:    lea    0xeb5(%rip),%rax        <span style="color: #998f84;"># </span><span style="color: #998f84;">0x555555556004</span>
   0x000055555555514f &lt;+22&gt;:    mov    %rax,-0x8(%rbp)
   0x0000555555555153 &lt;+26&gt;:    mov    -0x8(%rbp),%rax
   0x0000555555555157 &lt;+30&gt;:    mov    %rax,%rdi
   0x000055555555515a &lt;+33&gt;:    call   0x555555555030 <a href="mailto:puts%40plt">&lt;puts@plt&gt;</a>
   0x000055555555515f &lt;+38&gt;:    mov    $<span style="color: #ffa724;">0</span>x0,%eax
   0x0000555555555164 &lt;+43&gt;:    leave  
   0x0000555555555165 &lt;+44&gt;:    ret    
End of assembler dump.
(gdb) stepi
0x000055555555514f      5         char *s = <span style="color: #f4cf86;">"Hello World"</span>;
(gdb) disas
Dump of assembler code for <span style="color: #ff2c4b; font-weight: bold;">function</span> <span style="color: #ffa724;">main</span>:
   0x0000555555555139 &lt;+0&gt;:     push   %rbp
   0x000055555555513a &lt;+1&gt;:     mov    %rsp,%rbp
   0x000055555555513d &lt;+4&gt;:     sub    $<span style="color: #ffa724;">0</span>x20,%rsp
   0x0000555555555141 &lt;+8&gt;:     mov    %edi,-0x14(%rbp)
   0x0000555555555144 &lt;+11&gt;:    mov    %rsi,-0x20(%rbp)
   0x0000555555555148 &lt;+15&gt;:    lea    0xeb5(%rip),%rax        <span style="color: #998f84;"># </span><span style="color: #998f84;">0x555555556004</span>
=&gt; 0x000055555555514f &lt;+22&gt;:    mov    %rax,-0x8(%rbp)
   0x0000555555555153 &lt;+26&gt;:    mov    -0x8(%rbp),%rax
   0x0000555555555157 &lt;+30&gt;:    mov    %rax,%rdi
   0x000055555555515a &lt;+33&gt;:    call   0x555555555030 <a href="mailto:puts%40plt">&lt;puts@plt&gt;</a>
   0x000055555555515f &lt;+38&gt;:    mov    $<span style="color: #ffa724;">0</span>x0,%eax
   0x0000555555555164 &lt;+43&gt;:    leave  
   0x0000555555555165 &lt;+44&gt;:    ret    
End of assembler dump.
(gdb) c
Continuing.
Hello World
[Inferior 1 (process 5638) exited normally]
(gdb) q
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
